use crate::{error::parse_err_with_reason, xgxt::personal_info::Dormitory};
use std::convert::Infallible;

/// 将宿舍信息解析为电量查询系统接受的类型，返回 (park, build, room)
#[expect(clippy::too_many_lines, reason = "REFACTOR ME")]
pub fn parse_dormitory(
    dormitory: Dormitory,
) -> Result<(u8, String, String), crate::Error<Infallible>> {
    let park = dormitory.park().expect("参数 dormitory 必须成功解析");
    let build = dormitory.build().expect("参数 dormitory 必须成功解析");
    let room = dormitory.room();
    let park_id = match park {
        "南校区" => 1,
        "财院校区" => 2,
        "天马园区" => 3,
        "德智园区" => 4,
        "德智留学生公寓" => 5,
        "望麓桥学生公寓" => 6,
        "牛头山学生公寓" => 7,
        v => return Err(parse_err_with_reason(v, "park")),
    };
    let build_id = match (park_id, build) {
        // 南校区
        (1, "7舍") => "19-1",
        (1, "8舍") => "20",
        (1, "10舍") => "21",
        (1, "11舍") => "21-0",
        (1, "12舍") => "21-1",
        (1, "13舍") => "21-2",
        (1, "14舍") => "22",
        (1, "15舍") => "23",
        (1, "17舍") => "24",
        (1, "18舍") => "25",
        // 19舍比较特殊，常见情况：南校区/19舍/1-附204，南校区/19舍/2-320
        (1, "19舍") => {
            let no = room
                .chars()
                .next()
                .ok_or(parse_err_with_reason(room, "room"))?;
            match no {
                '1' => "25-1",
                '2' => "25-2",
                '3' => "25-3",
                '4' => "25-4",
                _ => {
                    return Err(parse_err_with_reason(room, "room"));
                }
            }
        }
        (1, "南楼") => "26",
        (1, "培训小楼") => "27",
        // 财院校区
        (2, "1") => "01",
        (2, "2") => "02",
        (2, "3") => "02-01",
        (2, "5") => "03",
        (2, "6") => "04",
        (2, "12") => "05",
        (2, "A") => "06",
        (2, "B") => "07",
        (2, "7") => "08", // 研楼7栋
        // 天马园区
        (3, "一区1栋") => "28",
        (3, "一区2栋") => "29",
        (3, "一区3栋") => "30",
        (3, "一区4栋") => "30-1",
        (3, "二区1栋") => "31",
        (3, "二区2栋") => "32",
        (3, "二区3栋") => "33",
        (3, "二区4栋") => "34",
        (3, "二区5栋") => "35",
        (3, "二区6栋") => "36",
        (3, "二区7栋") => "37",
        (3, "三区9栋") => "38",
        (3, "三区10栋") => "39",
        (3, "三区11栋") => "40",
        (3, "三区12栋") => "41",
        (3, "三区13栋") => "42",
        (3, "三区16栋") => "43",
        (3, "三区17栋") => "44",
        (3, "三区18栋") => "45",
        (3, "三区19栋") => "46",
        (3, "三区20栋") => "46-1",
        (3, "四区1栋") => "47",
        (3, "四区2栋") => "48",
        (3, "四区3栋") => "49",
        (3, "四区4栋") => "50",
        // (3, "事务大楼") => "56", // TODO 目前代码这里应该是解析不到的，等待数据修复
        // 德智园区
        (4, "2栋") => "09",
        (4, "5栋") => "10",
        (4, "6栋") => "11",
        (4, "7栋") => "12",
        (4, "8栋") => "13",
        (4, "9栋") => "14",
        (4, "10栋") => "15",
        (4, "11栋") => "16",
        (4, "13栋") => "17",
        (4, "15栋") => "17-01",
        (4, "16栋") => "17-02",
        // 德智留学生公寓，似乎只有一个
        (5, _) => "18",
        // 望麓桥学生公寓
        (6, "1栋") => "51",
        (6, "2栋") => "#2栋",
        (6, "3栋") => "#3栋",
        (6, "4栋") => "57",
        // 牛头山学生公寓
        (7, "2栋") => "60",
        (7, "3栋") => "61",
        (7, "4栋") => "62",
        (7, "5栋") => "63",
        (7, "6栋") => "64",
        (7, "7栋") => "65",
        _ => {
            return Err(parse_err_with_reason(
                &format!("{:?}", (park, build)),
                "(park, build)",
            ));
        }
    };
    let room_id = match (park_id, build, room) {
        // TODO 财院校区A栋，请在房间号首位加上A、B、C，暂时不知道怎么处理
        // 德智园区，在房间号前加上楼栋号：
        (4, "2栋", r) => format!("2{}", r),
        (4, "5栋", r) => format!("5{}", r),
        (4, "6栋", r) => format!("6{}", r),
        (4, "7栋", r) => format!("7{}", r),
        (4, "8栋", r) => format!("8{}", r),
        (4, "9栋", r) => format!("9{}", r),
        (4, "10栋", r) => format!("10{}", r),
        (4, "11栋", r) => format!("11{}", r),
        // 南校区19舍附楼，请在房间号前加上F：
        // 常见情况：南校区/19舍/1-附204，南校区/19舍/2-320
        (1, "19舍", r) => {
            let parts = r.split('-').collect::<Vec<&str>>();
            if parts.len() != 2 {
                return Err(parse_err_with_reason(r, "room"));
            }
            if parts[1].starts_with('附') {
                format!("F{}", parts[1].replace('附', ""))
            } else {
                parts[1].to_string()
            }
        }
        (_, _, r) => r.to_string(),
    };
    Ok((park_id, build_id.to_string(), room_id))
}
